Revit 2027 API
CurveByPoints.GetPoints Method
Get the sequence of points interpolated by this curve.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ReferencePointArray GetPoints()
Public Function GetPoints As ReferencePointArray
public:
ReferencePointArray^ GetPoints()
member GetPoints : unit -> ReferencePointArray
Return Value
ReferencePointArray
See Also
Reference
CurveByPoints Class
Autodesk.Revit.DB Namespace